NOTES.tex
% Created 2022-05-15 Sun 18:36
% Intended LaTeX compiler: pdflatex
\documentclass[letterpaper, 11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{lmodern} % Ensures we have the right font
\usepackage[T1]{fontenc}
\usepackage[utf8]{inputenc}
\usepackage{graphicx, breqn}
\usepackage{mathtools, amsthm, amssymb, breqn}
\usepackage[table, xcdraw]{xcolor}
\definecolor{bblue}{HTML}{0645AD}
\usepackage[colorlinks]{hyperref}
\hypersetup{colorlinks, linkcolor=blue, urlcolor=bblue}
\usepackage{titling}
\setlength{\droptitle}{-6em}
\setlength{\parindent}{0pt}
\setlength{\parskip}{1em}
\usepackage[stretch=10]{microtype}
\usepackage{hyphenat}
\usepackage{ragged2e}
\usepackage{subfig} % Subfigures (not needed in Org I think)
\usepackage{hyperref} % Links
\usepackage{listings} % Code highlighting
\usepackage{pgfplots} % Plotting graphs
\usepackage{efbox}
\usepackage{tikz}
\usepackage{onimage} % note that onimage.sty must be in the working directory.
\usepackage[top=1in, bottom=1.25in, left=1.55in, right=1.55in]{geometry}
\renewcommand{\baselinestretch}{1.15}
\usepackage[explicit]{titlesec}
\pretitle{\begin{center}\fontsize{20pt}{20pt}\selectfont}
\posttitle{\par\end{center}}
\preauthor{\begin{center}\vspace{-6bp}\fontsize{14pt}{14pt}\selectfont}
\postauthor{\par\end{center}\vspace{-25bp}}
\predate{\begin{center}\fontsize{12pt}{12pt}\selectfont}
\postdate{\par\end{center}\vspace{0em}}
\titlespacing\section{0pt}{5pt}{5pt} % left margin, space before section header, space after section header
\titlespacing\subsection{0pt}{5pt}{-2pt} % left margin, space before subsection header, space after subsection header
\titlespacing\subsubsection{0pt}{5pt}{-2pt} % left margin, space before subsection header, space after subsection header
\usepackage{enumitem}
\setlist{itemsep=-2pt} % or \setlist{noitemsep} to leave space around whole list
\usepackage {mathtools , amssymb , amsthm}
\author{Fred Mitchell}
\date{\today}
\title{Slit Scan Notes}
\hypersetup{
 pdfauthor={Fred Mitchell},
 pdftitle={Slit Scan Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.1.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Slit Scan Notes}
\label{sec:org6eb2e17}
\subsection{Disclaimer}
\label{sec:org4f46cbb}
These are my basic notes on this project, and are not
meant for general consumption, and therefore are not
gauranteed to be accurate or even useful for anyone 
other than myself. Please see the README.org or the
README.pdf for that.
\subsection{Loading Images}
\label{sec:orged4c4cb}
\begin{itemize}
\item We could resize one of the images to be the 
exact same size/dimensions of the other. Would simplify 
the math quite a bit. But might cause some wierdness
in some circumstances. Of course, the user
can correct the issue and make sure both images
are the same dimensions, etc.
\item Trying to determine how to transverse the images 
slit-wise. In mapping the images, we are simply
given the x,y coordinates. Of course, we can
work backwards from there to determine the "slit",
and should cover this in the math description in the README.
\end{itemize}
\subsubsection{Pipelining}
\label{sec:org6ef2448}
We can manipulate the source images to be the same size, and rotate
them to do a horizontal scan. For 2 images, we create each canvas
seperately, then combine them during the compositing phase.

Indeed, we shall take a pipelining approach, so we can run all of this
in parallel to utilize all the available cores.
\subsection{Scanning the images}
\label{sec:orge9bb387}
It just occured to me that we should scan from the basis of the canvas, since
that is the target, and simply do the math transforms to the source images.
This way, we can handle blending / dithering / smoothing between pixels on the
destination image (canvas) very naturally.

In fact, we can utilize the normal mapping function of the destination, and 
simply address the pixels via the index fuction from the sources.

\subsubsection{Orign of Graphics.Image images}
\label{sec:org4b6246b}
The origin is in the upper-left corner and descends down and right.
This is typical of computer graphics going all the way back to the raster scan
days which almost invariably stated from the upper left and scanned to the
right and down.

From a mathematical perspective, I have always found this annoying, but for
purposes of keeping things "simple", I will embrace that in my math here.
\subsubsection{Scan Direction}
\label{sec:org701786c}
On the source images, we will initally scan from right to left, meaning that
conceptually the source image is moving from left to right. Time t is a Double
parameter, even though a single tick of t represents one pixel.

Scan speed is based on scans per second, which will be somewhat related to 
frames per second, but not perfectly.

\subsubsection{Scan Index (si)}
\label{sec:orgea2c597}
The scan index roughly relates to the frame index (fi) but is based
on the number of scans per second. On the first frame, si will be less than 
the actual scan width of both the source and canvas. This will eventually change,
where the scan index will exceed the scan width of the source, in which
case -- for now, it will wrap around.

For the canvas, it will simply go to the end and stop.

In actuality, I don't think there's anything special we need to do for the
canvas. It's all on the source, and handling the wrap-around correctly.

\subsection{Outputting the video}
\label{sec:orgb804303}
We shall use "out" as the path-filename fragment, where
a 4-digit (or 5-digit?) sequence number shall be appened,
along with the .EXT (default is png).

Later on, we'll change this to do a video file directly. 

\subsection{Future planned enhancements}
\label{sec:org3add731}
\end{document}